sdaiGetAggrElementBoundByIndex(Sdai_Id_aggr*,System.UInt32)
\details
Retrieves the bound of an aggregate element by its index.
\param aggregate [in] An aggregate.
\param index     [in] An index of the element.
\returns An SDAI integer value that contains the bound of the aggregate element.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiIX_NVLD - Index invalid.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiVA_NSET - Value not set.
* sdaiVT_NVLD - Value type invalid.
* sdaiEX_NSUP - Expression evaluation not supported.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.